app/Controllers/AccountController.php

    public function acceder()
    {
        $correoElectronico = $this->request->getPost('correo_electronico');
        $contrasena = $this->request->getPost('contrasena');

        if (is_array($correoElectronico) || is_array($contrasena)) {
            return redirect()->to(site_url('login'))->with('error', 'Datos de entrada no válidos.');
        }

        // Buscar usuario por correo electrónico
        $usuario = $this->usuarioModel->where('correo_electronico', $correoElectronico)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo_electronico` = 'abogado@gmail.com'
 LIMIT 1