app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        // Obtener todos los usuarios desde el modelo
        $usuarios = $this->usuarioModel->findAll();

SELECT *
FROM `usuarios`
---
    public function obtenerUsuarios()
    {
        $usuarios = $this->usuarioModel->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '7'
---
    public function obtenerUsuarioPorId($id)
    {
        $usuario = $this->usuarioModel->find($id);