app/Controllers/Usuarios.php

    public function agregarUsuario()
    {
        $nombre = $this->request->getPost("nombre");
        $apellidoPaterno = $this->request->getPost("apellido_paterno");
        $apellidoMaterno = $this->request->getPost("apellido_materno");
        $correoElectronico = $this->request->getPost("correo_electronico");
        $perfil = $this->request->getPost("perfil");
        $contrasena = $this->request->getPost("contrasena");
        $contrasena_db = password_hash($contrasena, PASSWORD_DEFAULT);

        $data = [];

        // Verificar si ya existe un usuario con el mismo correo electrónico
        $existingUser = $this->usuarioModel->where('correo_electronico', $correoElectronico)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo_electronico` = '0013zkr@gmail.com'
 LIMIT 1