app/Models/AbogadoModel.php

    public function obtenerAbogadosConInfo()
    {
        return $this->db->table('abogados a')
            ->select('a.id AS abogado_id, u.id AS usuario_id, u.nombre AS usuario_nombre, u.apellido_paterno AS usuario_apellido_paterno, u.apellido_materno AS usuario_apellido_materno, u.correo_electronico AS correo_electronico, s.id AS sucursal_id, s.nombre AS sucursal_nombre, a.especialidad, a.telefono, a.fecha_creacion AS abogado_fecha_creacion')
            ->join('usuarios u', 'a.id_usuario = u.id')
            ->join('sucursales s', 'a.id_sucursal = s.id')
            ->get()
            ->getResultArray();
---
SELECT `a`.`id` AS `abogado_id`, `u`.`id` AS `usuario_id`, `u`.`nombre` AS `usuario_nombre`, `u`.`apellido_paterno` AS `usuario_apellido_paterno`, `u`.`apellido_materno` AS `usuario_apellido_materno`, `u`.`correo_electronico` AS `correo_electronico`, `s`.`id` AS `sucursal_id`, `s`.`nombre` AS `sucursal_nombre`, `a`.`especialidad`, `a`.`telefono`, `a`.`fecha_creacion` AS `abogado_fecha_creacion`
FROM `abogados` `a`
JOIN `usuarios` `u` ON `a`.`id_usuario` = `u`.`id`
JOIN `sucursales` `s` ON `a`.`id_sucursal` = `s`.`id`

    public function agregarAbogado($data)
    {
        return $this->insert($data);
---
INSERT INTO `abogados` (`id_usuario`, `id_sucursal`, `especialidad`, `telefono`) VALUES ('7', '2', '', '666')