app/Models/UsuarioModel.php

SELECT `id`, `nombre`, `apellido_paterno`, `apellido_materno`, `correo_electronico`
FROM `usuarios`
WHERE `perfil` = 2
---
    public function getUsuariosPerfil2()
    {
        return $this->select('id, nombre, apellido_paterno, apellido_materno, correo_electronico')
            ->where('perfil', 2)
            ->findAll();

UPDATE `usuarios` SET `nombre` = 'Alessandra', `apellido_paterno` = 'Viera', `apellido_materno` = 'galarza', `correo_electronico` = 'ale@gmail.com', `perfil` = '1'
WHERE `usuarios`.`id` IN ('6')
---
    public function editarUsuario($id, $data)
    {
        return $this->update($id, $data);